; domain
(define (domain ithar-quest)
  (:requirements :strips :typing :negative-preconditions)

  ;;------------------ TYPES ------------------
  (:types character location item)

  ;;---------------- CONSTANTS ----------------
  (:constants
     thandor abandoned_temple dark_forest
     collapsed_bridge malreks_tower            - location
     bow light_amulet crystal_of_ithar         - item)

  ;;---------------- PREDICATES ---------------
  (:predicates
    (at ?c - character ?l - location)
    (connected ?from - location ?to - location)
    (has ?c - character ?i - item)
    (item-at ?i - item ?l - location)
    (wood_collected)
    (bridge_rebuilt)
    (spirits_banished)
    (malrek_defeated)
  )

  ;;---------------- ACTIONS ------------------
  (:action move
    :parameters (?p - character ?from - location ?to - location)
    :precondition (and (at ?p ?from) (connected ?from ?to))
    :effect (and (not (at ?p ?from)) (at ?p ?to))
  )

  (:action gather-wood
    :parameters (?p - character)
    :precondition (and (at ?p dark_forest)
                       (not (wood_collected)))
    :effect (wood_collected)
  )

  (:action find-amulet
    :parameters (?p - character)
    :precondition (and (at ?p abandoned_temple)
                       (item-at light_amulet abandoned_temple))
    :effect (and (has ?p light_amulet)
                 (not (item-at light_amulet abandoned_temple)))
  )

  (:action banish-spirits
    :parameters (?p - character)
    :precondition (and (at ?p dark_forest)
                       (has ?p light_amulet)
                       (not (spirits_banished)))
    :effect (spirits_banished)
  )

  (:action rebuild-bridge
    :parameters (?p - character)
    :precondition (and (at ?p collapsed_bridge)
                       (wood_collected)
                       (not (bridge_rebuilt)))
    :effect (and (bridge_rebuilt)
                 (connected collapsed_bridge malreks_tower)
                 (connected malreks_tower collapsed_bridge))
  )

  (:action defeat-malrek
    :parameters (?p - character)
    :precondition (and (at ?p malreks_tower)
                       (bridge_rebuilt)
                       (spirits_banished)
                       (has ?p bow)
                       (item-at crystal_of_ithar malreks_tower)
                       (not (malrek_defeated)))
    :effect (and (malrek_defeated)
                 (has ?p crystal_of_ithar)
                 (not (item-at crystal_of_ithar malreks_tower)))
  )

  (:action return-to-thandor
    :parameters (?p - character)
    :precondition (and (at ?p malreks_tower)
                       (has ?p crystal_of_ithar))
    :effect (and (not (at ?p malreks_tower))
                 (at ?p thandor))
  )
)

; problem
(define (problem retrieve-crystal)
  (:domain ithar-quest)

  ;; Solo gli oggetti NON già dichiarati come costanti
  (:objects
     elara   - character)

  (:init
     ;; stato iniziale
     (at elara thandor)
     (has elara bow)

     ;; oggetti posizionati nel mondo
     (item-at light_amulet abandoned_temple)
     (item-at crystal_of_ithar malreks_tower)

     ;; rete di percorsi esistenti (ponte ancora crollato)
     (connected thandor abandoned_temple)
     (connected abandoned_temple thandor)

     (connected thandor dark_forest)
     (connected dark_forest thandor)

     (connected abandoned_temple dark_forest)
     (connected dark_forest abandoned_temple)

     (connected dark_forest collapsed_bridge)
     (connected collapsed_bridge dark_forest)
  )

  (:goal
     (and (at elara thandor)
          (has elara crystal_of_ithar))
  )
)

; plan
1. (move elara thandor abandoned_temple)
   deleted: (at elara thandor)
   added: (at elara abandoned_temple)
   goals met: 0 of 2
2. (find-amulet elara)
   deleted: (item-at light_amulet abandoned_temple)
   added: (has elara light_amulet)
   goals met: 0 of 2
3. (move elara abandoned_temple dark_forest)
   deleted: (at elara abandoned_temple)
   added: (at elara dark_forest)
   goals met: 0 of 2
4. (banish-spirits elara)
   added: (spirits_banished)
   goals met: 0 of 2
5. (gather-wood elara)
   added: (wood_collected)
   goals met: 0 of 2
6. (move elara dark_forest collapsed_bridge)
   deleted: (at elara dark_forest)
   added: (at elara collapsed_bridge)
   goals met: 0 of 2
7. (rebuild-bridge elara)
   added: (bridge_rebuilt) (connected collapsed_bridge malreks_tower) (connected malreks_tower collapsed_bridge)
   goals met: 0 of 2
8. (move elara collapsed_bridge malreks_tower)
   deleted: (at elara collapsed_bridge)
   added: (at elara malreks_tower)
   goals met: 0 of 2
9. (defeat-malrek elara)
   deleted: (item-at crystal_of_ithar malreks_tower)
   added: (malrek_defeated) (has elara crystal_of_ithar)
   goals met: 1 of 2
10. (return-to-thandor elara)
   deleted: (at elara malreks_tower)
   added: (at elara thandor)
   goals met: 2 of 2
